adfsadf#%% md
## Starting with pandas

Importing pandas

In [1]:
import pandas as pd

creating a one diamentional data sets

In [2]:
planes = pd.Series(["Boeing", "Airbus", "Emberier"])
print(planes)

0      Boeing
1      Airbus
2    Emberier
dtype: object

In [3]:
df = pd.read_csv("Resources/car-sales.csv")

In [4]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### Exporting data
index = False get's rid of all the indexes

In [5]:
df.to_csv('Exports/exported car sales.csv', index = False)

### Describing data

finding the data types of each column

In [6]:
df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

listing the columns

In [7]:
df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [8]:
df.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

 Discribing columns
 Mind that this only works for numeric columns (The reason that the price is not visible)

In [9]:
df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

More data views :)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

IF you wanna find the way here is the way to do it.

In [11]:
df.mean(numeric_only= True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

If you wanna find the sum

In [12]:
df.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [13]:
df["Doors"].sum()

np.int64(40)

### Viewing and selecting data

In [14]:
df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [15]:
df.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [16]:
df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [17]:
df.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

* loc (stands for literal index)
* iloc (stands for position)

In [18]:
#in this case since all the index are in the correct order both will give  the same output
# df.loc[3]
df.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [19]:
# df.iloc[3]
df.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Since isloc and loc behaves like list it also supports expressions like `:<integer value>` 
    for example `:3` will provide all the elements up to 3.

Boolean indexing (Mind that you can place any conditional selectors inside)

In [20]:
df[df["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

We can use the cross tab functionality to create the view two columns in aggregation kinda way

In [21]:
pd.crosstab(df.Make, df.Doors)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

If we want to view insites by coulmns you can use the `groupby()` function

In [22]:
df.groupby(["Make"]).mean(numeric_only= True)
# `numeric_only= True` This will make sure that the pandas won't get confuced my non numerical values

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

Since the data in the price section is actuelly a type object but not real interger we have to treat that and make it a numeric value

In [23]:
df["Price"] = pd.to_numeric(
    df["Price"].str.replace(r"[^\d.\-]", "", regex=True),
    errors="coerce"
)

In [24]:
df.head()

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0

What ever you can do with do in `string` in my python you can do in `str`

# Missing data imputation

In [25]:
dfmd = pd.read_csv("Resources/car-sales-missing-data.csv")

In [26]:
dfmd.head()

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [27]:
dfmd

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Since the `Odometer` is a missing value let's fill it with mean.

In [28]:
mean_value = dfmd["Odometer"].mean()
# inplace= True is like saving the data cause we don't want to manuelly assign in again to the same variable
dfmd["Odometer"].fillna(mean_value, inplace= True)
dfmd

/var/folders/1f/y4m0v325195fz_rklx7x78440000gn/T/ipykernel_6224/1417461705.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dfmd["Odometer"].fillna(mean_value, inplace= True)

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [29]:
dfmd

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

We can also drop missing values

In [30]:
dfmd.dropna(inplace= True)

In [31]:
dfmd

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [32]:
dfmd.to_csv("car_sales_missing_filled.csv", index= False)

### Creating a column

In [33]:
df

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [34]:
df["Seats"] = pd.Series(["5", "5"])

Mind that we need the exact same amount of data to fill all the raws if we try inserting data

In [35]:
df

     Make Colour  Odometer (KM)  Doors    Price Seats
0  Toyota  White         150043      4   4000.0     5
1   Honda    Red          87899      4   5000.0     5
2  Toyota   Blue          32549      3   7000.0   NaN
3     BMW  Black          11179      5  22000.0   NaN
4  Nissan  White         213095      4   3500.0   NaN
5  Toyota  Green          99213      4   4500.0   NaN
6   Honda   Blue          45698      4   7500.0   NaN
7   Honda   Blue          54738      4   7000.0   NaN
8  Toyota  White          60000      4   6250.0   NaN
9  Nissan  White          31600      4   9700.0   NaN

In [36]:
df.Seats.fillna("5", inplace= True)

/var/folders/1f/y4m0v325195fz_rklx7x78440000gn/T/ipykernel_6224/1102690442.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Seats.fillna("5", inplace= True)

In [37]:
df

     Make Colour  Odometer (KM)  Doors    Price Seats
0  Toyota  White         150043      4   4000.0     5
1   Honda    Red          87899      4   5000.0     5
2  Toyota   Blue          32549      3   7000.0     5
3     BMW  Black          11179      5  22000.0     5
4  Nissan  White         213095      4   3500.0     5
5  Toyota  Green          99213      4   4500.0     5
6   Honda   Blue          45698      4   7500.0     5
7   Honda   Blue          54738      4   7000.0     5
8  Toyota  White          60000      4   6250.0     5
9  Nissan  White          31600      4   9700.0     5

In [38]:
df["Fuel per 100KM"] = [7.5, 9.2, 5.0, 9.6, 8.7, 4.7, 7.6, 8.7, 3.0, 4.5]

In [39]:
df

     Make Colour  Odometer (KM)  Doors    Price Seats  Fuel per 100KM
0  Toyota  White         150043      4   4000.0     5             7.5
1   Honda    Red          87899      4   5000.0     5             9.2
2  Toyota   Blue          32549      3   7000.0     5             5.0
3     BMW  Black          11179      5  22000.0     5             9.6
4  Nissan  White         213095      4   3500.0     5             8.7
5  Toyota  Green          99213      4   4500.0     5             4.7
6   Honda   Blue          45698      4   7500.0     5             7.6
7   Honda   Blue          54738      4   7000.0     5             8.7
8  Toyota  White          60000      4   6250.0     5             3.0
9  Nissan  White          31600      4   9700.0     5             4.5

In [40]:
df["Total fuel used"] = df["Odometer (KM)"] * df["Fuel per 100KM"] / 100
## Pandas will take care of executing raw per raw thing :)

In [41]:
df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,150043,4,4000.0,5,7.5,11253.225
1,Honda,Red,87899,4,5000.0,5,9.2,8086.708
2,Toyota,Blue,32549,3,7000.0,5,5.0,1627.450
3,BMW,Black,11179,5,22000.0,5,9.6,1073.184
4,Nissan,White,213095,4,3500.0,5,8.7,18539.265
5,Toyota,Green,99213,4,4500.0,5,4.7,4663.011
6,Honda,Blue,45698,4,7500.0,5,7.6,3473.048
7,Honda,Blue,54738,4,7000.0,5,8.7,4762.206
8,Toyota,White,60000,4,6250.0,5,3.0,1800.000
9,Nissan,White,31600,4,9700.0,5,4.5,1422.000

In [42]:
df["No of wheels"] = 4

In [43]:
df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used,No of wheels
0,Toyota,White,150043,4,4000.0,5,7.5,11253.225,4
1,Honda,Red,87899,4,5000.0,5,9.2,8086.708,4
2,Toyota,Blue,32549,3,7000.0,5,5.0,1627.450,4
3,BMW,Black,11179,5,22000.0,5,9.6,1073.184,4
4,Nissan,White,213095,4,3500.0,5,8.7,18539.265,4
5,Toyota,Green,99213,4,4500.0,5,4.7,4663.011,4
6,Honda,Blue,45698,4,7500.0,5,7.6,3473.048,4
7,Honda,Blue,54738,4,7000.0,5,8.7,4762.206,4
8,Toyota,White,60000,4,6250.0,5,3.0,1800.000,4
9,Nissan,White,31600,4,9700.0,5,4.5,1422.000,4

In [44]:
df.drop("No of wheels", inplace= True, axis= 1)
# axis = 1 let's pandas know that we are doing a column operation

In [45]:
df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,150043,4,4000.0,5,7.5,11253.225
1,Honda,Red,87899,4,5000.0,5,9.2,8086.708
2,Toyota,Blue,32549,3,7000.0,5,5.0,1627.450
3,BMW,Black,11179,5,22000.0,5,9.6,1073.184
4,Nissan,White,213095,4,3500.0,5,8.7,18539.265
5,Toyota,Green,99213,4,4500.0,5,4.7,4663.011
6,Honda,Blue,45698,4,7500.0,5,7.6,3473.048
7,Honda,Blue,54738,4,7000.0,5,8.7,4762.206
8,Toyota,White,60000,4,6250.0,5,3.0,1800.000
9,Nissan,White,31600,4,9700.0,5,4.5,1422.000

In [47]:
# only select 50% of the data
shuffled_df = df.sample(frac = 0.5)
shuffled_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
8,Toyota,White,60000,4,6250.0,5,3.0,1800.000
6,Honda,Blue,45698,4,7500.0,5,7.6,3473.048
4,Nissan,White,213095,4,3500.0,5,8.7,18539.265
9,Nissan,White,31600,4,9700.0,5,4.5,1422.000
2,Toyota,Blue,32549,3,7000.0,5,5.0,1627.450

Mind that we can use `sample()` method for sampling data sets while shuffling them as well.
we have to use the "frac" parameter to define the fraction of data that we need to separate.

In [60]:
# To reset what we shuffled
reOrdered_df = shuffled_df.reset_index(drop= True)
#Mind that the `drop=True` is important so that old index would be deleted.
# Without this parameter it would add a new column called `index` and save the old indexes to it.
reOrdered_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,60000,4,6250.0,5,3.0,1800.000
1,Honda,Blue,45698,4,7500.0,5,7.6,3473.048
2,Nissan,White,213095,4,3500.0,5,8.7,18539.265
3,Nissan,White,31600,4,9700.0,5,4.5,1422.000
4,Toyota,Blue,32549,3,7000.0,5,5.0,1627.450

You can’t apply a custom Python function like myfunction(x) directly to a DataFrame column — you still need .apply() (or .map()) to call it per element:

df["col"] = df["col"].apply(myfunction)


✅ You don’t need .apply() only when your function is vectorized (like NumPy’s np.log, np.sqrt, etc.).

❌ Regular Python functions aren’t vectorized — pandas won’t auto-broadcast them.

So we will need the `apply()` or the `map()` function to make it work.

In [61]:
df['Odometer (KM)'] = df['Odometer (KM)'].apply(lambda x: x/1.6)
# Suppose that we found that the values were from miles and we want to convert them in to KMs
df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,93776.875,4,4000.0,5,7.5,11253.225
1,Honda,Red,54936.875,4,5000.0,5,9.2,8086.708
2,Toyota,Blue,20343.125,3,7000.0,5,5.0,1627.450
3,BMW,Black,6986.875,5,22000.0,5,9.6,1073.184
4,Nissan,White,133184.375,4,3500.0,5,8.7,18539.265
5,Toyota,Green,62008.125,4,4500.0,5,4.7,4663.011
6,Honda,Blue,28561.250,4,7500.0,5,7.6,3473.048
7,Honda,Blue,34211.250,4,7000.0,5,8.7,4762.206
8,Toyota,White,37500.000,4,6250.0,5,3.0,1800.000
9,Nissan,White,19750.000,4,9700.0,5,4.5,1422.000